parametric_campaign/cases/DOE_Case_003/system/controlDict
FoamFile
{
    format      ascii;
    class       dictionary;
    object      controlDict;
}
application     simpleFoam;
startFrom       startTime;
startTime       0;
stopAt          endTime;
endTime         350;
deltaT          1;
writeControl    timeStep;
writeInterval   350;
purgeWrite      1;
writeFormat     ascii;
writePrecision  7;
writeCompression off;
timeFormat      general;
timePrecision   6;
runTimeModifiable false;

functions
{
    pressureDrop
    {
        type            surfaceFieldValue;
        libs            ("libfieldFunctionObjects.so");
        writeControl    timeStep;
        writeInterval   25;
        log             true;
        writeFields     false;
        surfaceFormat   none;
        regionType      patch;
        name            inlet;
        operation       areaAverage;
        fields          (p);
    }
}
